china-djyos/djyos/bsp/cpudrv/stm32/l433/src/uart/cpu_peri_uart.c
// =============================================================================
// 功能: 启动串口发送，包括两种情况，使用DMA或不使用DMA
// 参数: Reg,被操作的串口寄存器指针.
// 返回: 发送的个数
// =============================================================================
static u32 __UART_SendStart (tagUartReg *Reg,u32 timeout)
{
    u16 port,len=0;
    HAL_StatusTypeDef Ret;

    for(port = CN_UART1;port < CN_UART_NUM;port ++)
    {
        if(Reg == sUartCfg[port].Reg)
            break;
    }
    Board_UartHalfDuplexSend(port);
    if(port < CN_UART_NUM)
    {
        if(!sUartSending[port])
        {
            len = UART_PortRead(pUartCB[port],pUartSndBuf[port],CFG_UART_SENDBUF_LEN);
            if(len > 0)
            {
                sUartSending[port] = true;
                if(sUartDmaUsed[port])
                {
                    Ret = HAL_UART_Transmit_DMA(phuart[port],pUartSndBuf[port],len);
                }
                else
                {
                    Ret = HAL_UART_Transmit_IT(phuart[port],pUartSndBuf[port],len);
                }
                if(Ret != HAL_OK)
                {
                    Board_UartHalfDuplexRecv(port);
                    sUartSending[port] = false;
                }
            }
        }
    }

    return len;
}

// =============================================================================
// 功能：配置是否使用DMA传输，
// 参数：port，使用的串口号
//      enable,1 or 0,使能或禁能
// 返回：无
// =============================================================================
void __UART_SetDmaUsed(u8 port,u8 enable)
{
    u8 IntLine;
    if( (false == sUartDmaUsed[port]) && (enable) )
    {
        __HAL_RCC_DMA1_CLK_ENABLE();
        __HAL_RCC_DMA2_CLK_ENABLE();
        HAL_UART_Abort(phuart[port]);

        if(phuart[port]->hdmarx == NULL)
        {
            phuart[port]->hdmarx = (DMA_HandleTypeDef*)malloc(2*sizeof(DMA_HandleTypeDef));
            if(NULL == phuart[port]->hdmarx)
                return;
            phuart[port]->hdmatx = phuart[port]->hdmarx + 1;
        }

        phuart[port]->hdmarx->Instance = sUartCfg[port].DmaRxCh;
        phuart[port]->hdmarx->Init.Direction = DMA_PERIPH_TO_MEMORY;
        phuart[port]->hdmarx->Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
        phuart[port]->hdmarx->Init.MemInc = DMA_MINC_ENABLE;
        phuart[port]->hdmarx->Init.Mode = DMA_CIRCULAR;
        phuart[port]->hdmarx->Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
        phuart[port]->hdmarx->Init.PeriphInc = DMA_PINC_DISABLE;
        phuart[port]->hdmarx->Init.Priority = DMA_PRIORITY_HIGH;
        phuart[port]->hdmarx->Init.Request = sUartCfg[port].DmaReq;
        phuart[port]->hdmarx->XferCpltCallback = 0;
        phuart[port]->hdmarx->XferHalfCpltCallback = 0;
        phuart[port]->hdmarx->XferErrorCallback = 0;
        phuart[port]->hdmarx->Parent = (void*)phuart[port];

        phuart[port]->hdmatx->Instance = sUartCfg[port].DmaTxCh;
        phuart[port]->hdmatx->Init.Direction = DMA_MEMORY_TO_PERIPH;
        phuart[port]->hdmatx->Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
        phuart[port]->hdmatx->Init.MemInc = DMA_MINC_ENABLE;
        phuart[port]->hdmatx->Init.Mode = DMA_NORMAL;
        phuart[port]->hdmatx->Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
        phuart[port]->hdmatx->Init.PeriphInc = DMA_PINC_DISABLE;
        phuart[port]->hdmatx->Init.Priority = DMA_PRIORITY_LOW;
        phuart[port]->hdmatx->Init.Request = sUartCfg[port].DmaReq;
        phuart[port]->hdmatx->XferCpltCallback = 0;
        phuart[port]->hdmatx->XferErrorCallback = 0;
        phuart[port]->hdmatx->XferHalfCpltCallback = 0;
        phuart[port]->hdmatx->Parent = (void*)phuart[port];
        HAL_DMA_Init(phuart[port]->hdmatx);
        HAL_DMA_Init(phuart[port]->hdmarx);

        sUartCfg[port].Reg->CR1 |= USART_CR1_IDLEIE;//enable idle int
        sUartDmaUsed[port] = true;

        IntLine = sUartCfg[port].DmaRxIntLine;
        Int_Register(IntLine);
        Int_SetClearType(IntLine,CN_INT_CLEAR_AUTO);
        Int_IsrConnect(IntLine,(u32(*)(ptu32_t))HAL_DMA_IRQHandler);
        Int_SetIsrPara(IntLine,(ptu32_t)(phuart[port]->hdmarx));
        Int_SettoAsynSignal(IntLine);
        Int_ClearLine(IntLine);
        Int_RestoreAsynLine(IntLine);

        IntLine = sUartCfg[port].DmaTxIntLine;
        Int_Register(IntLine);
        Int_SetClearType(IntLine,CN_INT_CLEAR_AUTO);
        Int_IsrConnect(IntLine,(u32(*)(ptu32_t))HAL_DMA_IRQHandler);
        Int_SetIsrPara(IntLine,(ptu32_t)(phuart[port]->hdmatx));
        Int_SettoAsynSignal(IntLine);
        Int_ClearLine(IntLine);
        Int_RestoreAsynLine(IntLine);
    }
    else if( (sUartDmaUsed[port]) && (!enable) )
    {
        HAL_UART_Abort(phuart[port]);
        free(phuart[port]->hdmarx);
        phuart[port]->hdmarx = NULL;
        phuart[port]->hdmatx = NULL;

        sUartCfg[port].Reg->ICR = USART_ICR_IDLECF;
        sUartCfg[port].Reg->CR1 &= ~USART_CR1_IDLEIE;
        sUartDmaUsed[port] = false;

        IntLine = sUartCfg[port].DmaRxIntLine;
        Int_IsrDisConnect(IntLine);
        Int_ClearLine(IntLine);
        Int_UnRegister(IntLine);

        IntLine = sUartCfg[port].DmaTxIntLine;
        Int_IsrDisConnect(IntLine);
        Int_ClearLine(IntLine);
        Int_UnRegister(IntLine);
    }
    else
    {

    }
    __UART_StartRecv(port);
}
// =============================================================================
// 功能: 串口设备的控制函数,与具体的硬件寄存器设置相关
// 参数: Reg,被操作的串口寄存器指针.
//       cmd,操作类型
//       data1,data2,含义依cmd而定
// 返回: 无意义.
// =============================================================================
static ptu32_t __UART_Ctrl(tagUartReg *Reg,u32 cmd, u32 data1,u32 data2)
{
    ptu32_t result = 0;
    u32 port;
    u32 timeout = 100000;
    for(port = CN_UART1;port < CN_UART_NUM;port ++)
    {
        if(Reg == sUartCfg[port].Reg)
            break;
    }
    if(port < CN_UART_NUM)
    {
        switch(cmd)
        {
        case CN_DEV_CTRL_START:
            __UART_Start(port);
            break;
        case CN_DEV_CTRL_STOP:
            __UART_Stop(port);
            break;
        case CN_DEV_CTRL_SHUTDOWN:
            break;
        case CN_DEV_CTRL_SLEEP:
            break;
        case CN_DEV_CTRL_RESUME:
            break;
        case CN_UART_SET_BAUD:
            __UART_BaudSet(port,data1);
            break;
        case CN_UART_COM_SET:
            __UART_ComConfig(Reg,port,data1);
            break;
//        case CN_UART_HALF_DUPLEX_SEND: //发送数据
//          Board_UartHalfDuplexSend(port);
//          break;
//        case CN_UART_HALF_DUPLEX_RECV: //接收数据
//            while((HAL_UART_STATE_READY != HAL_UART_GetState(phuart[port]))
//                  && (timeout > 10))
//            {
//                timeout -=10;
//                Djy_DelayUs(10);
//            }
//            Board_UartHalfDuplexRecv(port);
//          break;
        case CN_UART_DMA_USED:
            __UART_SetDmaUsed(port,1);
            break;
        case CN_UART_DMA_UNUSED:
            __UART_SetDmaUsed(port,0);
            break;
        default:
            break;
        }
    }
    return result;
}

